import { ServiceItem } from './types';

// Real API URL for Google Apps Script (Courses/Leads)
export const API_URL = "https://script.google.com/macros/s/AKfycbydQ_R7RuDz-SjleaiHFe5AI5bHzZ3psra9kuX_a-PvT8Dblwp-H26eQssXQmsnMsTdQQ/exec";

// Real API URL for News/Ticker
export const NEWS_API_URL = "https://script.google.com/macros/s/AKfycbydQ_R7RuDz-SjleaiHFe5AI5bHzZ3psra9kuX_a-PvT8Dblwp-H26eQssXQmsnMsTdQQ/exec";

export const SERVICES: ServiceItem[] = [
  {
    id: 1,
    title: 'הדרכה',
    description: 'הדרכת קורס אן אל פי, הדרכת כללים לפי תאום ותיעול לצורכי הלקוח/ חברה.',
    icon: 'globe',
    details: [
      {
        content: 'אירועים חברתיים המגובשים בזכות פעילות של סדנה או הרצאה מרתקת בתחום האן אל פי ובה משתתפים הצופים, הדרכת קורס אן אל פי המונה 20 מפגשים כאשר של מפגש בן 4 שעות אחת לשבוע.'
      },
      {
        title: 'הדרכת כללים לפי תאום ותיעול צורכי הלקוח',
        content: 'אירועים חברתיים המגובשים בזכות פעילות של סדנה או הרצאה מרתקת בתחום האן אל פי ובה משתתפים הצופים, בניית מדריך פנימי למוסדות ולעסקים, הדגשת כללי בית העסק המשדרגת את רמת השירות ומצמצמת מקרים של חוסר וודאות. בניית כללי עבודה התואמים את אופי התמחות העסק.'
      }
    ]
  },
  {
    id: 2,
    title: 'ייעוץ',
    description: 'יעוץ ארגוני ויעוץ פיננסי לעסקים ולמגזר הפרטי',
    icon: 'compass',
    details: [
      {
        title: 'ייעוץ ארגוני / פיננסי לעסקים ולמגזר הפרטי',
        content: 'אירועים חברתיים המגובשים בזכות פעילות של סדנה או הרצאה מרתקת בתחום האן אל פי ובה משתתפים הצופים, - שירותי הייעוץ כוללים איסוף נתונים של מידע ארגוני ופיננסי של הלקוח/בית העסק ובניית תקציב ניהול על בסיס המידע, הייעוץ מתקיים במתכונת של פגישה שבועית לבניית התקציב ניהול אידאלי ואופן ההתנהלות הכללי, בניית אסטרטגיה בשיתוף מומחים בתחום כמו כן יצירת שיתופים בכל נושא, לאימות התקדמות פרויקטים אשר נמצאים בהתהוות, מעקב אחר משימות, התנסות בתחום העיסוק בעזרת סימולציה מול מצב נתון.'
      },
      {
        title: 'ייעוץ משכנתאות וכלכלת המשפחה',
        content: 'ייעוץ זה ניתן לבתי אב אשר רוצים ללמוד כיצד להתנהל באופן האידיאלי ביותר, הטמעת כלים להתנהלות נכונה, בניית דוחות כלכליים (הכנסות הוצאות), התנהלות מול הבנקים (תשלומי עמלות ושונות למיניהן), בדיקת כדאיות ורווחיות המשכנתא (הקיימת או המבוקשת).'
      }
    ]
  },
  {
    id: 3,
    title: 'ליווי אישי/עסקי',
    description: 'ליווי להעצמה המשלב כלי התנהלות מעולם האן אל פי לאדם ואו לחברה',
    icon: 'map',
    details: [
      {
        title: 'ליווי אישי להעצמה אישית של הלקוח / בית העסק',
        content: 'אירועים חברתיים המגובשים בזכות פעילות של סדנה או הרצאה מרתקת בתחום האן אל פי ובה משתתפים הצופים, המובילה המפגשים פרונטליים בני שעה עד שעתיים, חד שבועיים, מול הלקוח/ות / עובדים, הכוללים ניתוח המפה האישית של הלקוח / עובד, התאמת כלים ללקוח המשרתים את מטרתו (זוגיות, פרנסה, תחום עיסוק וכדו\'), בדיקת אופן התנהלות אידיאלי ללקוח המשלבת את כלי אן אל פי ומסייעת לפתח ערוצים נוספים בכל אחד מהתחומים בין אם מדובר באדם פרטי או בעובדי חברות.'
      }
    ]
  },
  {
    id: 4,
    title: 'הנחייה',
    description: 'הנחייה של הרצאות וסדנאות מרתקות פורצות דרך בעולם הNLP, הנחיית אירועים חברתיים ופרזנטציה לעסקים',
    icon: 'heart',
    details: [
      {
        title: 'הנחיית אירועים חברתיים',
        content: 'אירועים חברתיים המגובשים בזכות פעילות של סדנה או הרצאה מרתקת בתחום האן אל פי ובה משתתפים הצופים, המובילה ליצירת כימיה בין המשתתפים, וקידום שיתופי פעולה חברתי בניהם, ניתן לתאם את תוכן האירוע לפי צורכי הלקוח החברה או המוסדות השונים. כמות המשתתפים בסדנה תתואם מול הלקוח.'
      },
      {
        title: 'פרזנטציה לעסקים',
        content: 'מפגש שבועי בו נייצר הקמת בסיס מידע רלוונטי לתחומי העסק אשר משרת יכולת שיווק פנומנאלית וליווי מלא של הצגת מוצר השיווק אל מול הלקוח.'
      }
    ]
  }
];